tap "buo/cask-upgrade", trusted: true
tap "hashicorp/tap", trusted: true
tap "terraform-docs/tap", trusted: true
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# Library for manipulating PNG images
brew "libpng"
# Library for ARIB STD-B24, decoding JIS 8 bit characters and parsing MPEG-TS
brew "aribb24"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Extremely Fast Compression algorithm
brew "lz4"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Official Amazon AWS command-line interface
brew "awscli"
# Text-based UI library
brew "ncurses"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db"
# GNU binary tools for native development
brew "binutils"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Mozilla CA bundle for Python
brew "certifi"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# C access to FITS data files with optional Fortran wrappers
brew "cfitsio"
# GIF encoder written in C
brew "cgif"
# Ultralightweight JSON parser in ANSI C
brew "cjson"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Color-highlighted diff(1) output
brew "colordiff"
# YAML Parser
brew "libyaml"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# HTTP/2 C Library
brew "libnghttp2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Recursive piecewise hashing tool
brew "ssdeep"
# Test domains for typo squatting, phishing and corporate espionage
brew "dnstwist"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Classic UNIX line editor
brew "ed"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Asynchronous event library
brew "libevent"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Emacs text editor
brew "emacs"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# VP8/VP9 video codec
brew "libvpx"
# Audio codec
brew "opus"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# AV1 encoder
brew "svt-av1"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# LLVM's OpenMP runtime library
brew "libomp"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Utility to determine file types
brew "file-formula"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Command-line tools for fly.io services
brew "flyctl"
# Brokered message queue optimized for performance
brew "fq"
# Minimalistic plugin API for video effects
brew "frei0r"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Automatic updates of GeoIP2 and GeoIP Legacy databases
brew "geoipupdate"
# GitHub command-line tool
brew "gh"
# Library and utilities for processing GIFs
brew "giflib"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Image processing and image analysis library
brew "leptonica"
# Secure hashing function
brew "libb2"
# Multi-format archive and compression library
brew "libarchive"
# International domain name library
brew "libidn"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Native sequence editor for Git interactive rebase
brew "git-interactive-rebase-tool"
# Git extension for versioning large files
brew "git-lfs"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# GNU implementation of which utility
brew "gnu-which"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Apply a diff file to an original
brew "gpatch"
# GNU grep, egrep and fgrep
brew "grep"
# Make JSON greppable
brew "gron"
# Popular GNU data compression program
brew "gzip"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Adaptive Entropy Coding implementing Golomb-Rice algorithm
brew "libaec"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# File format designed to store large amounts of data
brew "hdf5"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Portable abstraction of the hierarchical topology of modern architectures
brew "hwloc"
# Improved colored diff
brew "icdiff"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# High dynamic-range image file format
brew "openexr"
# New file format for still image compression
brew "jpeg-xl"
# Open h.265 video codec implementation
brew "libde265"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full", link: true
# Palette quantization library extracted from pnquant2
brew "libimagequant"
# Library for complex text layout
brew "libraqm"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Alternative to the official immich-CLI command written in Go
brew "immich-go"
# GNU utilities for networking
brew "inetutils"
# Official CLI for the IPinfo IP Address API
brew "ipinfo-cli"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Library for manipulating JPEG-2000 images
brew "jasper"
# JBIG2 encoder (for monochrome documents)
brew "jbig2enc"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Sophisticated file transfer program
brew "lftp"
# Implementation of the Unicode line- and word-breaking algorithms
brew "libunibreak"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# EXIF parsing library
brew "libexif"
# Library for large linear classification
brew "liblinear"
# C library for reading and writing MATLAB MAT files
brew "libmatio"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Library for sample rate conversion of audio data
brew "libsamplerate"
# Vorbis general audio compression codec
brew "libvorbis"
# MP3 player for Linux and UNIX
brew "mpg123"
# C library for files containing sampled sound
brew "libsndfile"
# NaCl networking and cryptography library
brew "libsodium"
# High quality, one-dimensional sample-rate conversion library
brew "libsoxr"
# C library for reading and writing PNG format files
brew "libspng"
# Fork of SQLite that is both Open Source, and Open Contributions
brew "libsql"
# Transcode video stabilization plugin
brew "libvidstab"
# GNOME XML library
brew "libxml2"
# File list utility with features from ls(1), find(1), stat(1), and du(1)
brew "lr"
# Powerful, lightweight programming language
brew "lua"
# Utility for directing compilation
brew "make"
# Cryptographic & SSL/TLS library
brew "mbedtls"
# Memory profiler for Python applications
brew "memray"
# Fast and user friendly build system
brew "meson"
# High performance static file server
brew "miniserve"
# Nice to use pager for humans
brew "moor"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Remote terminal application
brew "mosh"
# Improved JPEG encoder
brew "mozjpeg"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Open source relational database management system
brew "mysql-client@8.0"
# Open source relational database management system
brew "mysql-client@8.4"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# NCurses Disk Usage
brew "ncdu"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Unix command-line queue utility
brew "nq"
# Platform-neutral API for system-level and libc-like functions
brew "nspr"
# Libraries for security-enabled client and server applications
brew "nss"
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# PNG image optimizing utility
brew "pngquant"
# Seamless operability between C++11 and Python
brew "pybind11"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# High performance message passing library
brew "open-mpi"
# Audio codecs extracted from Android open source project
brew "opencore-amr"
# C library to read whole-slide images (a.k.a. virtual slides)
brew "openslide"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# PNG file optimizer
brew "optipng"
# Oil Runtime Compiler (ORC)
brew "orc"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Parallel gzip
brew "pigz"
# Locking and sync for Pip requirements files
brew "pip-tools"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Object-relational database system
brew "postgresql@18", link: true
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Unix pager optimized for psql
brew "pspg"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Generic syntax highlighter
brew "pygments"
# Fastest and safest AV1 video encoder
brew "rav1e"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# RC file (dotfile) management
brew "rcm"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast non-cryptographic hash algorithm
brew "xxhash"
# Utility that provides fast incremental file transfer
brew "rsync"
# Audio time stretcher tool and library
brew "rubberband"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Intuitive find & replace CLI
brew "sd"
# Database of common MIME types
brew "shared-mime-info"
# Compression/decompression library aiming for high speed
brew "snappy"
# SOcket CAT: netcat on steroids
brew "socat"
# Audio codec designed for speech
brew "speex"
# Displays the differences between SQLite databases
brew "sqldiff"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Tool Command Language
brew "tcl-tk"
# Analyze how space is allocated inside an SQLite file
brew "sqlite-analyzer"
# SQLite remote copy tool
brew "sqlite-rsync"
# Secure Reliable Transport
brew "srt"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Open video compression format
brew "theora"
# Finds the field values which appear most often in a stream of records
brew "topfew"
# Parser generator tool
brew "tree-sitter-cli"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Displays Timezone differences with localtime in CLI (shell script)
brew "tzdiff"
# Extraction utility for .zip compressed archives
brew "unzip"
# Collection of Linux utilities
brew "util-linux"
# Cross-platform Rust rewrite of the GNU coreutils
brew "uutils-coreutils"
# Cross-platform Rust rewrite of the GNU diffutils
brew "uutils-diffutils"
# Cross-platform Rust rewrite of the GNU findutils
brew "uutils-findutils"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Command-line tool to help build, run, and test web extensions
brew "web-ext"
# Generate WireGuard profile from Cloudflare Warp account
brew "wgcf"
# Internet file retriever
brew "wget"
# Successor of GNU Wget, a file and recursive website downloader
brew "wget2"
# Simple xargs and apply replacement
brew "xe"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Tool for managing your YubiKey configuration
brew "ykman"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# High-performance, asynchronous messaging library
brew "zeromq"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Compression and file packaging/archive utility
brew "zip"
# UNIX shell (command interpreter)
brew "zsh"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Generate documentation from Terraform modules in various output formats
brew "terraform-docs/tap/terraform-docs"
# Webcam & audio device software
cask "ankerwork"
# Universal chat app powered by Matrix
cask "beeper"
# Display management tool
cask "betterdisplay"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Calendar software focusing on flexibility and reliability
cask "busycal"
# Contact manager focusing on efficiency
cask "busycontacts"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Matrix collaboration client
cask "element"
# Email client
cask "fastmail"
# Web browser
cask "firefox@developer-edition"
cask "font-atkinson-hyperlegible"
cask "font-atkinson-hyperlegible-mono"
cask "font-atkinson-hyperlegible-next"
cask "font-cascadia-code-nf"
cask "font-cascadia-mono-nf"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Secure video conferencing app
cask "jitsi-meet"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Official Nextcloud Talk Desktop client
cask "nextcloud-talk"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Visual communication software
cask "omnigraffle"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Used to access context-specific actions when text is selected
cask "popclip"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Thumbnails, static previews, cover art and metadata for video files
cask "quicklook-video"
# Save articles to read, highlight key content, and organise notes for review
cask "reader"
# Import highlights from Apple Books to Readwise
cask "readwise-ibooks"
# Font manager that helps preview, install, sync and manage fonts
cask "rightfont"
# Customizable email client
cask "thunderbird"
# Customizable email client
cask "thunderbird@beta"
# Control your data usage on slow or expensive networks
cask "tripmode"
# Email client
cask "tuta-mail"
# License free Wi-Fi, VPN, and Access Application for Organizations
cask "unifi-identity-endpoint"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network monitoring and troubleshooting tool
cask "wifiman"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
# Desktop client for the Zulip team chat platform
cask "zulip"
vscode "anthropic.claude-code"
vscode "bruno-api-client.bruno"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "pkief.material-icon-theme"
npm "npm-check-updates"
