tap "buo/cask-upgrade"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "brotli"
brew "giflib"
brew "highway"
brew "imath"
brew "jpeg-turbo"
brew "libpng"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "libvmaf"
brew "aom"
brew "ca-certificates"
brew "gettext"
brew "openssl@3"
brew "libssh2"
brew "readline"
brew "sqlite"
brew "aria2"
brew "aribb24"
brew "atuin"
brew "m4"
brew "autoconf"
brew "mpdecimal"
brew "python@3.11"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "libgit2"
brew "oniguruma"
brew "bat"
brew "berkeley-db"
brew "binutils"
brew "freetype"
brew "fontconfig"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "certifi"
brew "pycparser"
brew "cffi"
brew "cfitsio"
brew "cgif"
brew "cjson"
brew "cloudflared"
brew "colordiff"
brew "gmp"
brew "coreutils"
brew "cryptography"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "curl"
brew "dav1d"
brew "diff-so-fancy"
brew "difftastic"
brew "diffutils"
brew "direnv"
brew "ssdeep"
brew "dnstwist"
brew "docutils"
brew "duckdb"
brew "libevent"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "jansson"
brew "tree-sitter"
brew "emacs"
brew "entr"
brew "eza"
brew "fd"
brew "libogg"
brew "flac"
brew "frei0r"
brew "fribidi"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "lame"
brew "openjpeg"
brew "leptonica"
brew "libb2"
brew "libarchive"
brew "libunibreak"
brew "libass"
brew "libbluray"
brew "mbedtls"
brew "librist"
brew "libsamplerate"
brew "libvorbis"
brew "mpg123"
brew "opus"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libvidstab"
brew "libvpx"
brew "opencore-amr"
brew "pango"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "srt"
brew "svt-av1"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "zeromq"
brew "zimg"
brew "ffmpeg"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "hwloc"
brew "open-mpi"
brew "fftw"
brew "file-formula"
brew "findutils"
brew "flyctl"
brew "node"
brew "fx"
brew "fzf"
brew "gawk"
brew "gdbm"
brew "gdk-pixbuf"
brew "geoipupdate"
brew "gh"
brew "jbig2dec"
brew "libidn"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-interactive-rebase-tool"
brew "git-lfs"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "grep"
brew "gron"
brew "hadolint"
brew "libaec"
brew "pkg-config"
brew "hdf5"
brew "ncurses"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "hurl"
brew "icdiff"
brew "jasper"
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "libomp"
brew "libraw"
brew "libtool"
brew "imagemagick"
brew "ipinfo-cli"
brew "jaq"
brew "jbig2enc"
brew "libyaml"
brew "jc"
brew "jpegoptim"
brew "jq"
brew "lazygit"
brew "less"
brew "lftp"
brew "libexif"
brew "libimagequant"
brew "liblinear"
brew "libmatio"
brew "libraqm"
brew "librsvg"
brew "libspng"
brew "libsql"
brew "libxml2"
brew "lr"
brew "lua"
brew "make"
brew "micromamba"
brew "moar"
brew "protobuf"
brew "mosh"
brew "mozjpeg"
brew "mtr"
brew "mupdf"
brew "nano"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "nq"
brew "nspr"
brew "nss"
brew "oci-cli"
brew "ollama"
brew "openjdk"
brew "openslide"
brew "openssh"
brew "openssl@3.0"
brew "optipng"
brew "orc"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "pcre"
brew "perl"
brew "zopfli"
brew "pigz"
brew "tcl-tk"
brew "pillow"
brew "pipenv"
brew "pipx"
brew "pngquant"
brew "poetry"
brew "poppler"
brew "popt"
brew "postgresql@16", link: true
brew "pre-commit"
brew "prettier"
brew "pspg"
brew "pstree"
brew "pv"
brew "pwgen"
brew "pybind11"
brew "pyenv", args: ["HEAD"]
brew "pyenv-virtualenv"
brew "pygments"
brew "python-packaging"
brew "pyyaml"
brew "qpdf"
brew "rbenv"
brew "rclone"
brew "rcm"
brew "redis"
brew "rename"
brew "ripgrep"
brew "xxhash"
brew "rsync"
brew "ruby"
brew "ruff"
brew "sd"
brew "six"
brew "socat"
brew "sqlfluff"
brew "sqlite-analyzer"
brew "ssh-copy-id"
brew "telnet"
brew "tesseract-lang"
brew "texlive"
brew "the_silver_searcher"
brew "tldr"
brew "topfew"
brew "tree"
brew "trippy"
brew "tzdiff"
brew "unpaper"
brew "uv"
brew "vespa-cli"
brew "vim"
brew "vips"
brew "virtualenv"
brew "wakeonlan"
brew "watch"
brew "wdiff"
brew "wget"
brew "xe"
brew "yarn"
brew "ykman"
brew "yt-dlp"
brew "zsh"
brew "heroku/brew/heroku"
cask "appcleaner"
cask "betterdisplay"
cask "brewservicesmenubar"
cask "bruno"
cask "busycal"
cask "busycontacts"
cask "calibre"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jupyterlab"
cask "keka"
cask "kekaexternalhelper"
cask "languagetool"
cask "logi-options-plus"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "ngrok"
cask "obsidian"
cask "omnigraffle"
cask "onyx"
cask "open-in-code"
cask "readwise-ibooks"
cask "rightfont"
cask "rocket-chat"
cask "signal"
cask "skype"
cask "slack"
cask "sublime-merge"
cask "sublime-text"
cask "tailscale"
cask "telegram-desktop"
cask "transmission"
cask "tripmode"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
vscode "bruno-api-client.bruno"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "exiasr.hadolint"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gpoore.codebraid-preview"
vscode "james-yu.latex-workshop"
vscode "joe-re.sql-language-server"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "pkief.material-icon-theme"
